<template>
  <UDivider
      label="FAQ" class=""
      :ui="{ label: 'text-rose-500 dark:text-error-500 font-bold text-xl', line: 'bg-green-500' }"
  />
  <div class="py-2 mx-2">
    <UAccordion class="text-start "
      multiple
      :items="[{
        label: 'ฉันทำคำสั่งซื้อจาก www.wireless-guru.com ได้อย่างไร?', content: 'การสั่งซื้อจาก wireless-guru.com ง่ายและสะดวก กรุณาเลือกรายการจากร้านค้าออนไลน์ให้ส่งข้อมูลการติดต่อของคุณ, ที่อยู่จัดส่งและสั่งซื้อของคุณจะถูกประมวลผลจากร้านค้าบนเว็บ นอกจากนี้คุณสามารถส่งอีเมล์ที่มีรายการที่คุณต้องการ, ชื่อ บริษัท ของคุณที่อยู่จัดส่งที่สมบูรณ์หมายเลขโทรศัพท์และข้อมูลการลงทะเบียนธุรกิจของคุณ หลังจากที่ได้รับการสั่งซื้อเราจะติดต่อคุณกลับมาทางอีเมล์ พร้อมใบเสนอราคา (Performa Invoice) ที่มีการยืนยันการสั่งซื้อ การยืนยันการสั่งซื้อจะรวมถึงการรับทราบการสั่งซื้อแสดงค่าใช้จ่ายทั้งหมดรวมทั้งการขนส่งและภาษีมูลค่าเพิ่ม\n'+
'เมื่อคุณได้ใบเสนอราคา(Performa Invoice) แล้ว คุณจะต้องจัดให้มีการชำระเงิน เราจะจัดส่งสินค้าเมื่อเราได้รับเงินครบถ้วนเท่านั้น' }, {

        label: 'ฉันสามารถชำระเงินสำหรับการสั่งซื้อสินค้าของฉันได้อย่างไร?', content: 'คุณสามารถชำระเงินด้วยการโอนเงินผ่านธนาคาร' +
         ' ซึ่งหมายความว่าคุณต้องจ่ายจากธนาคารของคุณไปยังบัญชีธนาคารของเรา (ดูรายละเอียด)'+''+
          'หมายเหตุ : กรุณาโทรสอบถามสินค้าทุกครั้งก่อนสั่งซื้อ'+
          ' กรณีสั่งซื้อสินค้าประเภท Accessories คิดค่าจัดส่งสินค้าง 100 บาท ต่อครั้ง'+''+
        'สอบถาม : 02 769 8201,095-554-4841 E-mail : sales@wireless-guru.com' }, {

        label: 'การสั่งซื้อแต่ละครั้งมีขั้นต่ำหรือไม่?', content: 'ไม่มีขั้นต่ำ' }, {
        label: 'คุณจัดส่งสินค้าอย่างไร', content: '' +
         'เราจัดส่งสินค้าทันที หลังจากได้รับการชำระเงินเรียบร้อยแล้ว ทางพัสดุไปรษณีย์ (Logistics Post)' +
         ' แต่ถ้าสินค้าจำนวนน้อย น้ำหนักเบา ก็จะจัดส่งทาง EMS'+'ขนส่งเอกชน อื่นๆ'+'สินค้าที่จะจัดส่งอาจจะต้องใช้เวลา 3-14 วัน ' +
         'ในกรณีนี้จะแจ้งให้ลูกค้าทราบล่วงหน้า พร้อมใบเสนอราคา (Performa Invoice) เพื่อลูกค้าจะได้ตัดสินใจก่อน ยีนยันการซื้อและชำระเงิน' },{

        label: 'ฉันจะต้องเสียภาษีมูลค่าเพิ่มหรือไม่?', content: 'เราเป็นบริษัทฯ ที่จดทะเบียนการค้าในประเทศไทย และจดทะเบียนภาษีมูลค่าเพิ่ม' +
         ' สินค้าที่นำเข้าจากประเทศผู้ผลิต เมื่อนำเข้ามาราชอาณาจักร จะต้องเสียภาษีมูลค่าเพิ่มทุกรายการ ' +
         'ดังนั้น การสั่งซื้อสินค้าจาก www.wireless-guru.com จำเป็นต้องคิดภาษีมูลเพิ่ม 7% ทุกรายการ' },{

        label: 'ขั้นตอนการสมัครสมาชิก?', content: 'test' },{

        label: 'ขั้นตอนการสั่งซื้อ?', content: 'test' },{

        label: 'ขั้นตอนการชำระเงิน?', content: 'test' },]"
  />
  </div>
</template>

<script setup lang="ts">

</script>

<style scoped>

</style>